/**
 * JS面试题映射表(key是文件名称，value是文档的标题)
 */
export const JSTitle = {
  "cookie-session-token": "cookie与session与token",
  "call-apply-bind": "call与apply与bind",
  "web-storage": "Web Storage",
  "element-views": "元素在视口的可见性",
  "typeof-instanceof": "typeof与instanceof",
  "type-conversion": "类型转换机制",
  "async-sync": "同步和异步",
  "web-worker": "Web Worker",
  "event-loop": "事件循环",
  "design-patterns": "设计模式",
  copy: "深浅拷贝",
  prototype: "原型",
  cors: "同源策略",
  var: "声明变量的三种方式",
  language: "强弱类型语言",
  module: "模块化",
  requestAnimation: "requestAnimation",
  class: "Class",
  test: "手写专区",
};

/**
 * HTML面试题文件与标题映射表
 */
export const HTMLTitle = {
  "src-href": "src和href的区别",
  "async-load": "异步加载脚本",
  html5: "HTML5新增",
  doctype: "DOCTYPE的作用",
};

/**
 * CSS面试题文件与标题映射表
 */
export const CSSTitle = {
  bfc: "BFC",
  "margin-padding": "magrin的取值",
  "z-index": "层叠上下文",
  selector: "CSS选择器",
  "containing-block": "包含块",
};

/**
 * 遇到的坑映射表(一级标题-二级标题：一级文件夹的名称-对应文件的名称)
 */
export const questionTitle = {
  // html
  "html-01": "限制文件域上传的类型",
  "html-02": "img标签渲染svg",
  // css
  "css-01": "字体描边",
  "css-02": "骨架屏",
  // js
  "js-01": "系统媒体控制",
  "js-02": "浏览器调用输入输出接口",
  "js-03": "字符与unicode",
  "js-04": "Web Worker",
  "js-05": "预览本地图片",
  "js-06": "图片的原始尺寸",
  "js-07": "拖拽上传",
  "js-08": "TouchEvent获取手指相对元素的偏移量",
  "js-09": "设计模式",
  "js-10": "全屏",
  "js-11": "给DOM绑定自定义事件",
  "js-12": "PWA",
  // node
  "node-01": "响应体类型一览",
  "node-02": "下载文件进度",
  "node-03": "SSE(服务端推送)",
  "node-04": "图片处理",
  "node-05": "解析url编码",
  "node-06": "__dirname not defined",
  "node-07": "媒体流",
  "node-08": "base64转图片",
  "node-09": "HTTPS 🔒",
  "node-10": "大文件上传",
  "node-11": "图片验证码",
  // vue
  "vue-01": "封装轮播图组件",
  "vue-02": "声明组件实例的类型",
  "vue-03": "样式穿透",
  "vue-04": "国际化i18n",
  "vue-05": "封装模态框",
  "vue-06": "JSX in Vue",
  "vue-07": "封装鉴权操作组件/指令",
  "vue-08": "路由模式",
  "vue-09": "命令式组件实践",
  "vue-10": "元素共享效果",
  "vue-11": "css-in-js",
  "vue-12": "指令式预览组件",
  "vue-13": "全局组件的 ts 类型提示",
  "vue-14": "h函数渲染插槽",
  "vue-15": "封装模态框",
  // vite
  "vite-01": "获取静态资源路径的函数",
  "vite-02": "不同模式下启动项目",
  "vite-03": "配置路径别名",
  "vite-04": "项目规范化",
  // other
  "other-01": "文件上传",
  "other-02": "PE/PC端判断",
  "other-03": "图片裁剪",
  "other-04": "封装路由参数校验的钩子",
  // ts
  "ts-01": "定义window扩展属性",
  "ts-02": "TS类型工具",
  "ts-03": "第三方库类型支持",
  "ts-04": "TS编译JS打包",
};
